DELETE FROM user_role;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password)
VALUES ('User', 'user@yandex.ru', 'password'),
       ('Admin', 'admin@gmail.com', 'admin'),
       ('Guest', 'guest@gmail.com', 'guest');

INSERT INTO user_role (role, user_id)
VALUES ('USER', 100000),
       ('ADMIN', 100001);

INSERT INTO meals (date_time, description, calories, user_Id)
VALUES
    ('2020-01-30 10:00:00', 'Завтрак', 500, 100000),
    ('2020-01-30 13:00:00', 'Обед', 1000, 100000),
    ('2020-01-30 20:00:00', 'Ужин', 500, 100000),
    ('2020-01-31 00:00:00', 'Еда на граничное значение', 100, 100000),
    ('2020-01-31 10:00:00', 'Завтрак', 1000, 100000),
    ('2020-01-31 13:00:00', 'Обед', 500, 100000),
    ('2020-01-31 20:00:00', 'Ужин', 410, 100000),
    ('2020-01-30 11:00:00', 'Завтрак', 500, 100001),
    ('2020-01-30 13:00:00', 'Обед', 1000, 100001),
    ('2020-01-30 21:00:00', 'Ужин', 500, 100001),
    ('2020-01-31 01:00:00', 'Еда на граничное значение', 100, 100001),
    ('2020-01-31 11:00:00', 'Завтрак', 1000, 100001),
    ('2020-01-31 14:00:00', 'Обед', 500, 100001),
    ('2020-01-31 21:00:00', 'Ужин', 410, 100001),
    ('2020-01-30 12:00:00', 'Завтрак', 500, 100002),
    ('2020-01-30 14:00:00', 'Обед', 1000, 100002),
    ('2020-01-30 22:00:00', 'Ужин', 500, 100002),
    ('2020-01-31 02:00:00', 'Еда на граничное значение', 100, 100002),
    ('2020-01-31 12:00:00', 'Завтрак', 1000, 100002),
    ('2020-01-31 15:00:00', 'Обед', 500, 100002),
    ('2020-01-31 22:00:00', 'Ужин', 410, 100002);